In [31]:
#DataFrame
d = {'Name':['John','Ram','Sita','Deva'],
     'Roll':[111,222,333,444],
     'Courses':['AIML','PYHTON','JAVA','JAVASCRIPT']}
d

{'Name': ['John', 'Ram', 'Sita', 'Deva'],
 'Roll': [111, 222, 333, 444],
 'Courses': ['AIML', 'PYHTON', 'JAVA', 'JAVASCRIPT']}

In [32]:
import pandas as pd

In [33]:
df = pd.DataFrame(d)
df

   Name  Roll     Courses
0  John   111        AIML
1   Ram   222      PYHTON
2  Sita   333        JAVA
3  Deva   444  JAVASCRIPT

In [34]:
#head : it represents top rows --> (by default - 5 rows)
df.head(2)

   Name  Roll Courses
0  John   111    AIML
1   Ram   222  PYHTON

In [35]:
#tail : it represents bottom rows --> (by default - 5 rows)
df.tail(2)

   Name  Roll     Courses
2  Sita   333        JAVA
3  Deva   444  JAVASCRIPT

In [36]:
#Rename
df = df.rename(columns={'Name':'S_Name'})
df

  S_Name  Roll     Courses
0   John   111        AIML
1    Ram   222      PYHTON
2   Sita   333        JAVA
3   Deva   444  JAVASCRIPT

In [37]:
#set_index : it sets as index column
df.set_index('Roll' , inplace = True) #inplace = True means it changes in original dataset (it also work by storing in var - df = set_index('Roll'))
df

     S_Name     Courses
Roll
111    John        AIML
222     Ram      PYHTON
333    Sita        JAVA
444    Deva  JAVASCRIPT

In [48]:
import numpy as np

In [53]:
d = pd.DataFrame({'Day':[1,2,3,4,5],
                  'Places':['Puri' , np.NaN , 'Kullu' , 'Diu' , 'Ooty'],
                  'Visitors':[1000,2000,3000,4000,5000]})
d

   Day Places  Visitors
0    1   Puri      1000
1    2    NaN      2000
2    3  Kullu      3000
3    4    Diu      4000
4    5   Ooty      5000

In [54]:
# To check missing values
d.isnull()

     Day  Places  Visitors
0  False   False     False
1  False    True     False
2  False   False     False
3  False   False     False
4  False   False     False

In [55]:
d.isnull().sum() #for big datasets

Day         0
Places      1
Visitors    0
dtype: int64

In [57]:
#To fill missing values
# fillna
d.Places.fillna('Manali' , inplace = True)

C:\Users\91732\AppData\Local\Temp\ipykernel_16176\3607650248.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d.Places.fillna('Manali' , inplace = True)

In [58]:
d

   Day  Places  Visitors
0    1    Puri      1000
1    2  Manali      2000
2    3   Kullu      3000
3    4     Diu      4000
4    5    Ooty      5000

In [59]:
# if the name of the features is not in rule(having space) then d.Places --->> d['no of places]

In [60]:
d.dtypes #to check datatypes

Day          int64
Places      object
Visitors     int64
dtype: object

In [63]:
# Total information about datasets
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Day       5 non-null      int64
 1   Places    5 non-null      object
 2   Visitors  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [65]:
d.Places[2] # Value in 2nd index of Places

'Kullu'

In [66]:
d.Places.unique() #Returns unique value

array(['Puri', 'Manali', 'Kullu', 'Diu', 'Ooty'], dtype=object)

In [67]:
d.Visitors.mean() # Avg of no of visitors

3000.0

In [68]:
d.Visitors.std() # Standard Deviation

1581.1388300841897

In [69]:
d.Visitors.var() # Variance

2500000.0

In [70]:
d.describe() # Returns all statistical calculation

            Day    Visitors
count  5.000000     5.00000
mean   3.000000  3000.00000
std    1.581139  1581.13883
min    1.000000  1000.00000
25%    2.000000  2000.00000
50%    3.000000  3000.00000
75%    4.000000  4000.00000
max    5.000000  5000.00000

In [71]:
d.describe(include = 'all')

             Day Places    Visitors
count   5.000000      5     5.00000
unique       NaN      5         NaN
top          NaN   Puri         NaN
freq         NaN      1         NaN
mean    3.000000    NaN  3000.00000
std     1.581139    NaN  1581.13883
min     1.000000    NaN  1000.00000
25%     2.000000    NaN  2000.00000
50%     3.000000    NaN  3000.00000
75%     4.000000    NaN  4000.00000
max     5.000000    NaN  5000.00000

In [77]:
# IRIS DATASET
iris = pd.read_csv(r"D:\jupyter_PY\CTTC-AIML\iris\iris.data") #read_csv --> comma separated value , read_excel , read_json ...
# if we don't want to change slases then we can put "r"
iris

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [79]:
iris = pd.read_csv(r"D:\jupyter_PY\CTTC-AIML\iris\iris.data",header = None) # header = None 
iris

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [81]:
iris.columns = ['SL','SW','PL','PW','FlowerType']
iris

      SL   SW   PL   PW      FlowerType
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [83]:
#Shape 
iris.shape

(150, 5)

In [85]:
iris.head(10)

    SL   SW   PL   PW   FlowerType
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa

In [86]:
iris.tail(10)

      SL   SW   PL   PW      FlowerType
140  6.7  3.1  5.6  2.4  Iris-virginica
141  6.9  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [87]:
iris.isnull().sum()

SL            0
SW            0
PL            0
PW            0
FlowerType    0
dtype: int64

In [89]:
iris.dtypes # its for all columns

SL            float64
SW            float64
PL            float64
PW            float64
FlowerType     object
dtype: object

In [90]:
iris.SL.dtypes # only for Sepal length or SL column

dtype('float64')

In [93]:
iris.FlowerType.dtypes

dtype('O')

In [94]:
iris.iloc[3:6] #for row slicing

    SL   SW   PL   PW   FlowerType
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa

In [95]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SL          150 non-null    float64
 1   SW          150 non-null    float64
 2   PL          150 non-null    float64
 3   PW          150 non-null    float64
 4   FlowerType  150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [96]:
iris.SL.unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [97]:
iris.columns

Index(['SL', 'SW', 'PL', 'PW', 'FlowerType'], dtype='object')

In [99]:
for i in iris.columns:
    print(i,':','\n',iris[i].unique(),'\n')

SL :
 [5.1 4.9 4.7 4.6 5.  5.4 4.4 4.8 4.3 5.8 5.7 5.2 5.5 4.5 5.3 7.  6.4 6.9
 6.5 6.3 6.6 5.9 6.  6.1 5.6 6.7 6.2 6.8 7.1 7.6 7.3 7.2 7.7 7.4 7.9]

SW :
 [3.5 3.  3.2 3.1 3.6 3.9 3.4 2.9 3.7 4.  4.4 3.8 3.3 4.1 4.2 2.3 2.8 2.4
 2.7 2.  2.2 2.5 2.6]

PL :
 [1.4 1.3 1.5 1.7 1.6 1.1 1.2 1.  1.9 4.7 4.5 4.9 4.  4.6 3.3 3.9 3.5 4.2
 3.6 4.4 4.1 4.8 4.3 5.  3.8 3.7 5.1 3.  6.  5.9 5.6 5.8 6.6 6.3 6.1 5.3
 5.5 6.7 6.9 5.7 6.4 5.4 5.2]

PW :
 [0.2 0.4 0.3 0.1 0.5 0.6 1.4 1.5 1.3 1.6 1.  1.1 1.8 1.2 1.7 2.5 1.9 2.1
 2.2 2.  2.4 2.3]

FlowerType :
 ['Iris-setosa' 'Iris-versicolor' 'Iris-virginica']

In [100]:
iris.describe()

               SL          SW          PL          PW
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [101]:
iris.FlowerType.value_counts()

FlowerType
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [102]:
iris.SL.value_counts()

SL
5.0    10
5.1     9
6.3     9
5.7     8
6.7     8
5.8     7
5.5     7
6.4     7
4.9     6
5.4     6
6.1     6
6.0     6
5.6     6
4.8     5
6.5     5
6.2     4
7.7     4
6.9     4
4.6     4
5.2     4
5.9     3
4.4     3
7.2     3
6.8     3
6.6     2
4.7     2
7.6     1
7.4     1
7.3     1
7.0     1
7.1     1
5.3     1
4.3     1
4.5     1
7.9     1
Name: count, dtype: int64